# ConduitSizes Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ConduitSizes Members
ConduitSizes Class Methods Properties See Also
---
The ConduitSizes type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Contains | Checks whether a conduit size with the nominal diameter exists. |
| Dispose | Releases all resources used by the ConduitSizes |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
| GetConduitSizesIterator | Returns a ConduitSizeIterator to the conduit sizes. |
| GetEnumerator | Returns an enumerator that iterates through a collection. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Count | Count of the items contained in the collection. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
ConduitSizes Class
Autodesk.Revit.DB.Electrical Namespace